$("#js").on("click",".wenhao",function(){
    window.location.href="chengshubiao.html"
})
function shangxian(b){
                       if(b>=0&&b<=330){
                              var c=b*0.9
                              if(c>=231){
                                c=231
                              }
                              $("#C").html(c.toFixed(2))
                        }
                        // 
                        if(b>330&&b<=600){
                              var c=b*0.7
                              if(c>=360){
                                c=360
                              }
                              $("#C").html(c.toFixed(2))
                      }
                      // 
                      if(b>600&&b<=800){
                              var c=b*0.6
                              if(c>=400){
                                c=400
                              }
                              $("#C").html(c.toFixed(2))
                      }
                      // 
                      if(b>800){
                              var c=b*0.5
                              $("#C").html(c.toFixed(2))
                      }
          //             var g=$("#C").html()
          // $("#D").attr("placeholder",parseFloat(g))
}
function jisuangongshi(){
	     var B=$("#B").html()
       // if(B.length<=0){
       //  B=$("#B").attr("placeholder")
       // }
       var D=$("#D").val()
       var G=parseFloat($("#G").val())
       if(D.length<=0){
       	// D=parseFloat($("#C").html())
          D=231
       }
       if($("#G").val().length<=0){
       	G=2.75
       }
      
       // var H
       var J
      // if($('#nba2').is(':checked')){
      //        H=1
      // }else{
      // 	H=0
      // }
      var I
      var I1
      var I2
      var K
      var K1
      var K2
      // alert(G)
      //  alert(D)
      var D1=D*(1+(G+3)*3/100+0.1)
      
       // alert(G+":"+(G+3))
console.log(H)
console.log(B)
console.log(D)
      		if(B>=0&&B<=50){
      			 I1=100+B*10000*0.005+100+B*10000*0.005*(1-H*0.5)
      		}
      		if(B>50&&B<=100){
      			 I1=100+(B-50)*10000*0.004+2500+100+B*10000*0.005*(1-H*0.5)
      		}
      		if(B>100&&B<=200){
      			 I1=100+(B-100)*10000*0.003+4500+100+B*10000*0.005*(1-H*0.5)
      		}
      		if(B>200&&B<=300){
      			 I1=100+(B-200)*10000*0.002+7500+100+B*10000*0.005*(1-H*0.5)
            
      		}
      		if(B>300&&B<=500){
      			 I1=100+(B-200)*10000*0.002+7500+100+B*10000*0.005-H*7500
             console.log(I1) 
             console.log(I1)
      		}
      		if(B>500){
      			 I1=100+(B-500)*10000*0.001+13500+100+B*10000*0.005-H*7500
      		}

      		if(D>=0&&D<=50){
      			I2=D*10000*0.005
      		}
      		if(D>50&&D<=100){
      			I2=(D-50)*10000*0.004+2500
      		}
      		if(D>100&&D<=200){
      			I2=(D-100)*10000*0.003+4500
      		}
      		if(D>200&&D<=500){
      			I2=(D-200)*10000*0.002+7500
            console.log(I2)
      		}
      		if(D>500){
      			I2=(D-500)*10000*0.001+13500
      		}

      if(0<D&&D<=3){
             I=I1+I2-80
            
      }else{
             I=I1+I2
             
      }
      console.log(I1+":"+I2)
      $("#I").html(I.toFixed(2))
      // 不动产转移印花税 
      if(H==0){
      if(B>=0&&B<=200){
           J=B*10000*0.01*1.05
      }
      if(B>200&&B<=400){
           J=((B-200)*10000*0.02+20000)*1.05
      }
      if(B>400){
           J=((B-400)*10000*0.03+60000)*1.05
           
      }
    }else{
      if(B>=0&&B<=200){
           J=B*10000*0.01*1.05-42000
           if(J<0){J=0}
      }
      if(B>200&&B<=400){
           J=((B-200)*10000*0.02+20000)*1.05-42000
            if(J<0){J=0}
      }
      if(B>400){
           J=((B-400)*10000*0.03+60000)*1.05-42000
            if(J<0){J=0}
           
      }
    }
     
      	$("#J").html(J.toFixed(2))
      
     
// alert(B)
// alert(D)
// alert(D1)
      
//  alert(G)     
     // 登记费

    if(B>=0&&B<=50){
           K1=100+B*10000*0.004   
      }
    if(B>50&&B<=100){
           K1=100+(B-50)*10000*0.003+2000   
      }
    if(B>100){
           K1=100+(B-100)*10000*0.002+3500   
      }
// alert(K1)
   
   if(D1>=0&&D1<=50){
           K2=D1*10000*0.004   
      }
   if(D1>50&&D1<=100){
           K2=(D1-50)*10000*0.003+2000   
      }
   if(D1>100){
           K2=(D1-100)*10000*0.002+3500   
      }
 // alert(K2)  
// alert(B+":"+D1)
      if(D!=0){
       
      	$("#K").html((K1+K2+100).toFixed(2))
       
      }else{
        
      	$("#K").html((K1+K2).toFixed(2))
    
      }
     
// 手续费及印花税


// if(H==1){
var k3=parseFloat($("#K").html())
// var iii=((I+J+k3-42000)/10000).toFixed(2)
// if(iii<0){iii=0}
//    $("#L").html(iii)
//  }else{
// var k3=parseFloat($("#K").html())
  $("#L").html(((I+J+k3)/10000).toFixed(2))
 // }
    
// 首期费用
// alert(D)
//  if(D.length==0){
//       D=parseFloat($("#C").html())
//       alert(1)
//       alert($("#C").html())
     $("#M").html((B-D).toFixed(2))
     // }
     // else{alert(3)
     //  $("#M").html((B-D).toFixed(2))
     // }
     // alert($("#C").html())
     // alert(B+":"+D)
     
// 每月供款
    var F=$("#F").html()

    var f1=Math.pow((1+G/1200),F)

     var N=(D*(G/1200)*f1)/(f1-1)

     // var N=(D*(G/1200)*(1+G/1200)^F)/((1+G/1200)^F-1)
     // $("#N").html(N.toFixed(4))
      $("#N").html((10000*N).toFixed(2))
// 贷款比率
$("#O").html((D/B*100).toFixed(2))
// 利率总额
$("#P").html((N*F-D).toFixed(2))
// 贷款总额
$("#Q").html(D)
}

// function jisuangongshi1(H){
// 	var B=$("#B").html()

//        var D=$("#D").val()
//        var G=$("#G").val()
//        if(D.length<=0){
//        	D=parseFloat($("#C").html())
//        }
//        if(G.length<=0){
//        	G=2.75
//        }
      
//        var H=H
//        var J
      
//       var I
//       var I1
//       var I2
//       var K
//       var K1
//       var K2
//       var D1=D*(1+(G+3)*3/100+0.1)
//       		if(B>=0&&B<=50){
//       			 I1=100+B*10000*0.005+100+B*10000*0.005*(1-H*0.5)
//       		}
//       		if(B>50&&B<=100){
//       			 I1=100+(B-50)*10000*0.004+2500+100+B*10000*0.005*(1-H*0.5)
//       		}
//       		if(B>100&&B<=200){
//       			 I1=100+(B-100)*10000*0.003+4500+100+B*10000*0.005*(1-H*0.5)
//       		}
//       		if(B>200&&B<=300){
//       			 I1=100+(B-200)*10000*0.002+7500+100+B*10000*0.005*(1-H*0.5)
//       		}
//       		if(B>300&&B<=500){
//       			 I1=100+(B-200)*10000*0.002+7500+100+B*10000*0.005-H*7500
//       		}
//       		if(B>500){
//       			 I1=100+(B-500)*10000*0.001+13500+100+B*10000*0.005-H*7500
//       		}

//       		if(D>=0&&D<=50){
//       			I2=D*10000*0.005
//       		}
//       		if(D>50&&D<=100){
//       			I2=(D-50)*10000*0.004+2500
//       		}
//       		if(D>100&&D<=200){
//       			I2=(D-100)*10000*0.003+4500
//       		}
//       		if(D>200&&D<=500){
//       			I2=(D-200)*10000*0.002+7500
//       		}
//       		if(D>500){
//       			I2=(D-500)*10000*0.001+13500
//       		}

//       if(0<D&&D<=3){
//              I=I1+I2-80
            
//       }else{
//              I=I1+I2
             
//       }
//       $("#I").html(I.toFixed(2))
//       // 不动产转移印花税 
//        // 不动产转移印花税 
//       if(H==0){
//       if(B>=0&&B<=200){
//            J=B*10000*0.01*1.05
//       }
//       if(B>200&&B<=400){
//            J=((B-200)*10000*0.02+20000)*1.05
//       }
//       if(B>400){
//            J=((B-400)*10000*0.03+60000)*1.05
           
//       }
//     }else{
//       if(B>=0&&B<=200){
//            J=B*10000*0.01*1.05-42000
//            if(J<0){J=0}
//       }
//       if(B>200&&B<=400){
//            J=((B-200)*10000*0.02+20000)*1.05-42000
//             if(J<0){J=0}
//       }
//       if(B>400){
//            J=((B-400)*10000*0.03+60000)*1.05-42000
//             if(J<0){J=0}
           
//       }
//     }
     
//         $("#J").html(J.toFixed(2))
     

//      // 登记费
//     if(B>=0&&B<=50){
//            K1=100+B*10000*0.004   
//       }
//     if(B>50&&B<=100){
//            K1=100+(B-50)*10000*0.003+2000   
//       }
//     if(B>100){
//            K1=100+(B-100)*10000*0.002+3500   
//       }

   
//    if(D1>=0&&D1<=50){
//            K2=D1*10000*0.004   
//       }
//    if(D1>50&&D1<=100){
//            K2=(D1-50)*10000*0.003+2000   
//       }
//    if(D1>100){
//            K2=(D1-100)*10000*0.002+3500   
//       }
//       if(D!=0){
//       	$("#K").html((K1+K2+100).toFixed(2))
//       }else{
//       	$("#K").html((K1+K2).toFixed(2))
//       }
//    // alert(K1+":"+K2)
// // 手续费及印花税


// if(H==1){
// var k3=parseFloat($("#K").html())
//    $("#L").html(((I+k3)/10000).toFixed(2))
//  }else{
// var k3=parseFloat($("#K").html())
//   $("#L").html(((I+J+k3)/10000).toFixed(2))
//  }
// // 首期费用
  
//      $("#M").html((B-D).toFixed(2))
// // 每月供款
//     var F=$("#F").html()
//     var f1=Math.pow((1+G/1200),F)
//      var N=(D*(G/1200)*f1)/(f1-1)
    
//      $("#N").html(N.toFixed(4))
// // 贷款比率
// $("#O").html((D/B*100).toFixed(2))
// // 利率总额
// $("#P").html((N*F-D).toFixed(2))
// // 贷款总额
// $("#Q").html(D)
// }
// 开始计算的展开和收起
    kfl.onclick=function(){
       $("#kf").css("display","block")
      jisuangongshi()
    }